// написати класс Гравець, клас вороги.
// Приватні змінні здоровя і мана, у ворога є приватна змінна урон.!!!!!!!!! + damage to hero
// І в гравця і в ворога є метод вдарити,
// Гравець може вдарити тільки по ворогу , і на оборот.
// У гравця і у ворога є метод получитиУрон.
// У гравця і ворога є фіксований урон.
// Метод вдарити використовує метод получитиУрон для опонента.
// В конструкторі ворога вказується кількість досвіду.
// Кожен рівень коштує 10000 досвіду.
// Урон героя збільшується на 10% на кожному рівні
// В гравця є метод Дебаф,
// у ворога є метод Дебафсебе який збільшує собі урон на 250%.
// На метод мана Дебаф і Дебафсебе використовується мана.
// Коли гравець використовує Дебаф на ворога,
// метод використається тільки якщо ворог Бафнутий.
// Мана героя відновлюється тільки якщо ворог помер,
